Repository: omnimind-ai/ViaVera
Catalog: OmniBot/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# …更早的终端输出已省略
source: …Earlier terminal output omitted
zh_hans: …更早的终端输出已省略

# “%@”不是可导入的普通文件。
source: “%@” is not a regular file that can be imported.
zh_hans: “%@”不是可导入的普通文件。

# “%@”超过 256 MB 的单文件上限。
source: “%@” exceeds the 256 MB file size limit.
zh_hans: “%@”超过 256 MB 的单文件上限。

# [无法启动终端：%@]
source: [Cannot start the terminal: %@]
zh_hans: [无法启动终端：%@]

# [终端异常结束：%@]
source: [The terminal exited unexpectedly: %@]
zh_hans: [终端异常结束：%@]

# [终端进程已结束，退出码 %lld]
source: [The terminal process exited with code %lld]
zh_hans: [终端进程已结束，退出码 %lld]

# %@ 无法保存失败状态：%@
source: %@ Could not save the failure state: %@
zh_hans: %@ 无法保存失败状态：%@

# %@ 无法确认当前钥匙串状态：%@
source: %@ Cannot verify the current Keychain state: %@
zh_hans: %@ 无法确认当前钥匙串状态：%@

# %@ · %lld 条消息
source: %@ · Messages: %lld
zh_hans: %@ · %lld 条消息

# %@ %@，占比 %@
source: %@ %@, share %@
zh_hans: %@ %@，占比 %@

# %@ Token · %@ 次模型响应
source: %@ tokens · %@ model responses
zh_hans: %@ Token · %@ 次模型响应

# %@ 点
source: %@ pt
zh_hans: %@ 点

# %@ 起的一周
source: Week of %@
zh_hans: %@ 起的一周

# %@，缓存读取
source: %@, cache reads
zh_hans: %@，缓存读取

# %@，输出
source: %@, output
zh_hans: %@，输出

# %@，非缓存输入
source: %@, uncached input
zh_hans: %@，非缓存输入

# %@（当前 · %@）
source: %@ (Current · %@)
zh_hans: %@（当前 · %@）

# %@消耗分布 · 输入、缓存读取与输出
source: %@ usage · input, cache reads, and output
zh_hans: %@消耗分布 · 输入、缓存读取与输出

# %lld 分 %lld 秒
source: %lld min %lld sec
zh_hans: %lld 分 %lld 秒

# %lld 条消息
source: Messages: %lld
zh_hans: %lld 条消息

# %lld分%lld秒
source: %lldm %llds
zh_hans: %lld分%lld秒

# %lld秒
source: %llds
zh_hans: %lld秒

# Agent 未能完成本次任务。
source: The agent could not complete this task.
zh_hans: Agent 未能完成本次任务。

# Agent 权限
source: Agent Permissions
zh_hans: Agent 权限

# Agent 正在思考…
source: The agent is thinking…
zh_hans: Agent 正在思考…

# Agent 的身份与工作边界
source: The agent’s identity and working boundaries
zh_hans: Agent 的身份与工作边界

# AI 服务商
source: AI Vendor
zh_hans: AI 服务商

# Alpine 官方源
source: Official Alpine Repository
zh_hans: Alpine 官方源

# Alpine 软件源
source: Alpine Package Repository
zh_hans: Alpine 软件源

# Alternate 锁定键
source: Alternate Lock Key
zh_hans: Alternate 锁定键

# API Key 删除失败：%@
source: Failed to delete the API key: %@
zh_hans: API Key 删除失败：%@

# canonical 凭据清理失败：%@
source: Failed to remove canonical credentials: %@
zh_hans: canonical 凭据清理失败：%@

# contains 需要两个参数。
source: contains requires two arguments.
zh_hans: contains 需要两个参数。

# Control 锁定键
source: Control Lock Key
zh_hans: Control 锁定键

# field 需要对象和字段名。
source: field requires an object and a field name.
zh_hans: field 需要对象和字段名。

# filter 需要记录列表、字段和查询文本。
source: filter requires a record list, a field, and search text.
zh_hans: filter 需要记录列表、字段和查询文本。

# get 必须引用已声明的状态。
source: get must reference declared state.
zh_hans: get 必须引用已声明的状态。

# Git 版本控制
source: Git Version Control
zh_hans: Git 版本控制

# Hi，有什么可以聊的
source: Hi, what would you like to work on?
zh_hans: Hi，有什么可以聊的

# iCloud 不可用。请检查 Apple 账户、iCloud 设置和应用的 iCloud 签名权限。
source: iCloud is unavailable. Check your Apple Account, iCloud settings, and the app’s signed iCloud entitlements.
zh_hans: iCloud 不可用。请检查 Apple 账户、iCloud 设置和应用的 iCloud 签名权限。

# iCloud 同步、历史备份与任务保活
source: iCloud sync, backup history and background tasks
zh_hans: iCloud 同步、历史备份与任务保活

# iCloud 备份与同步
source: iCloud backup and sync
zh_hans: iCloud 备份与同步

# iCloud 账户已更换。同步已暂停；请关闭再开启同步，确认将本机数据同步到当前账户。
source: The iCloud account has changed. Sync is paused. Turn sync off and on again to confirm syncing local data to this account.
zh_hans: iCloud 账户已更换。同步已暂停；请关闭再开启同步，确认将本机数据同步到当前账户。

# if 需要三个参数。
source: if requires three arguments.
zh_hans: if 需要三个参数。

# invoke 需要 operation。
source: invoke requires an operation.
zh_hans: invoke 需要 operation。

# iSH 终端视图创建失败。
source: Could not create the iSH terminal view.
zh_hans: iSH 终端视图创建失败。

# item 字段无效。
source: Invalid item field.
zh_hans: item 字段无效。

# JSON 字段数量超过上限。
source: The number of JSON fields exceeds the limit.
zh_hans: JSON 字段数量超过上限。

# JSON 嵌套超过上限。
source: JSON nesting exceeds the limit.
zh_hans: JSON 嵌套超过上限。

# JSON 数组超过 500 项。
source: The JSON array exceeds 500 items.
zh_hans: JSON 数组超过 500 项。

# Markdown 表格
source: Markdown Table
zh_hans: Markdown 表格

# Node.js 包管理器
source: Node.js Package Manager
zh_hans: Node.js 包管理器

# Node.js 运行时
source: Node.js Runtime
zh_hans: Node.js 运行时

# now 表达式无效。
source: Invalid now expression.
zh_hans: now 表达式无效。

# OmniBot 出现问题
source: OmniBot Encountered a Problem
zh_hans: OmniBot 出现问题

# OmniBot 无法启动
source: OmniBot Could Not Start
zh_hans: OmniBot 无法启动

# OmniBot 正在生成回复
source: OmniBot is generating a reply
zh_hans: OmniBot 正在生成回复

# onRefresh 只能调用已声明的被动读取能力。
source: onRefresh can only invoke declared passive read capabilities.
zh_hans: onRefresh 只能调用已声明的被动读取能力。

# OpenAI 兼容
source: OpenAI Compatible
zh_hans: OpenAI 兼容

# OpenSSH 服务器
source: OpenSSH Server
zh_hans: OpenSSH 服务器

# PDF 输入
source: PDF Input
zh_hans: PDF 输入

# Python 包安装器
source: Python Package Installer
zh_hans: Python 包安装器

# Python 解释器
source: Python Interpreter
zh_hans: Python 解释器

# Python 项目与包工具
source: Python Project and Package Manager
zh_hans: Python 项目与包工具

# Rootfs 已等待重置
source: Rootfs Reset Pending
zh_hans: Rootfs 已等待重置

# Rootfs 管理
source: Rootfs Management
zh_hans: Rootfs 管理

# set 和 append 必须提供 value。
source: set and append require a value.
zh_hans: set 和 append 必须提供 value。

# setSession 需要会话状态键和 value。
source: setSession requires a session state key and a value.
zh_hans: setSession 需要会话状态键和 value。

# Skill 操作
source: Skill Actions
zh_hans: Skill 操作

# SKILL.md 未提供可用的技能名称。
source: SKILL.md does not provide a valid skill name.
zh_hans: SKILL.md 未提供可用的技能名称。

# SSH 客户端
source: SSH Client
zh_hans: SSH 客户端

# SSH 密码辅助工具
source: SSH Password Helper
zh_hans: SSH 密码辅助工具

# toggleItem 必须提供字段名。
source: toggleItem requires a field name.
zh_hans: toggleItem 必须提供字段名。

# Token 使用趋势
source: Token Usage Trend
zh_hans: Token 使用趋势

# Token 堆叠柱状图，横轴为日期，纵轴为 Token 数量
source: Stacked token bar chart with dates on the horizontal axis and token counts on the vertical axis
zh_hans: Token 堆叠柱状图，横轴为日期，纵轴为 Token 数量

# Token 总用量
source: Total Token Usage
zh_hans: Token 总用量

# totp 整体组件已停用。请使用通用组件与 invoke 能力调用组合工具。
source: The standalone totp component is no longer supported. Use generic components with invoke capability calls.
zh_hans: totp 整体组件已停用。请使用通用组件与 invoke 能力调用组合工具。

# TOTP 组件需要声明 totp 能力，并放在列表之外。
source: TOTP components must declare the totp capability and be placed outside lists.
zh_hans: TOTP 组件需要声明 totp 能力，并放在列表之外。

# TXT 文件不能超过 1 MB。
source: TXT files cannot exceed 1 MB.
zh_hans: TXT 文件不能超过 1 MB。

# TXT 文件中没有认证链接。每行应为一条 otpauth://totp/ 链接。
source: The TXT file contains no authentication links. Put one otpauth://totp/ link on each line.
zh_hans: TXT 文件中没有认证链接。每行应为一条 otpauth://totp/ 链接。

# 一
source: Mon
zh_hans: 一

# 一个导入包只能包含顶层的 SKILL.md。
source: An import package can contain only a top-level SKILL.md.
zh_hans: 一个导入包只能包含顶层的 SKILL.md。

# 一次最多导入 16 个附件，当前选择了 %lld 个。
source: You can import up to 16 attachments at a time. You selected %lld.
zh_hans: 一次最多导入 16 个附件，当前选择了 %lld 个。

# 一键安装配置（%lld 项）
source: Install and Configure (%lld)
zh_hans: 一键安装配置（%lld 项）

# 三
source: Wed
zh_hans: 三

# 上下文压缩失败
source: Context Compaction Failed
zh_hans: 上下文压缩失败

# 上下文压缩失败：%@
source: Context compaction failed: %@
zh_hans: 上下文压缩失败：%@

# 上下文压缩已取消
source: Context compaction cancelled
zh_hans: 上下文压缩已取消

# 上下文已压缩
source: Context compacted
zh_hans: 上下文已压缩

# 上下文已压缩，正在重试…
source: Context compacted. Retrying…
zh_hans: 上下文已压缩，正在重试…

# 上下文接近上限，正在自动压缩…
source: Context is approaching the limit. Compacting automatically…
zh_hans: 上下文接近上限，正在自动压缩…

# 上下文窗口
source: Context Window
zh_hans: 上下文窗口

# 上下文超出模型上限，正在压缩后重试…
source: Context exceeds the model limit. Compacting before retrying…
zh_hans: 上下文超出模型上限，正在压缩后重试…

# 上方向键
source: Up Arrow
zh_hans: 上方向键

# 上次 Agent 运行因应用退出或系统中断而未完成。工具结果可能未知，请检查当前状态后再重试。
source: The previous agent run was interrupted when the app quit or the system stopped it. Tool results may be unknown. Check the current state before retrying.
zh_hans: 上次 Agent 运行因应用退出或系统中断而未完成。工具结果可能未知，请检查当前状态后再重试。

# 上次完成
source: Last completed
zh_hans: 上次完成

# 下方向键
source: Down Arrow
zh_hans: 下方向键

# 不支持的备份格式。
source: Unsupported backup format.
zh_hans: 不支持的备份格式。

# 不支持的文件类型
source: Unsupported File Type
zh_hans: 不支持的文件类型

# 不支持的能力操作。
source: Unsupported capability operation.
zh_hans: 不支持的能力操作。

# 不支持的运算。
source: Unsupported operation.
zh_hans: 不支持的运算。

# 临时 API Key 写入失败：%@
source: Failed to save the temporary API key: %@
zh_hans: 临时 API Key 写入失败：%@

# 临时凭据校验不一致。
source: Temporary credential verification did not match.
zh_hans: 临时凭据校验不一致。

# 临时凭据清理失败：%@
source: Failed to remove temporary credentials: %@
zh_hans: 临时凭据清理失败：%@

# 临时凭据读取校验失败：%@
source: Failed to read and verify temporary credentials: %@
zh_hans: 临时凭据读取校验失败：%@

# 临时文件超过上限，请重新打开工具。
source: Temporary files exceed the size limit. Reopen the tool.
zh_hans: 临时文件超过上限，请重新打开工具。

# 临时端点绑定写入失败：%@
source: Failed to save the temporary endpoint binding: %@
zh_hans: 临时端点绑定写入失败：%@

# 主题
source: Theme
zh_hans: 主题

# 主题模式
source: Theme Mode
zh_hans: 主题模式

# 了解常用模型，以及各模型的消耗占比。
source: See your most-used models and their share of usage.
zh_hans: 了解常用模型，以及各模型的消耗占比。

# 二
source: Tue
zh_hans: 二

# 二维码图片
source: QR Code Image
zh_hans: 二维码图片

# 云端数据无法验证，已保留本机数据。
source: Cloud data could not be validated. Local data has been retained.
zh_hans: 云端数据无法验证，已保留本机数据。

# 五
source: Fri
zh_hans: 五

# 亮度
source: Brightness
zh_hans: 亮度

# 仅支持 otpauth://totp 认证链接。
source: Only otpauth://totp authentication links are supported.
zh_hans: 仅支持 otpauth://totp 认证链接。

# 仅支持 otpauth://totp/ 认证链接。
source: Only otpauth://totp/ authentication links are supported.
zh_hans: 仅支持 otpauth://totp/ 认证链接。

# 今天
source: Today
zh_hans: 今天

# 今日记忆
source: Today’s Memory
zh_hans: 今日记忆

# 代码语言：%@
source: Code language: %@
zh_hans: 代码语言：%@

# 以下组件安装后仍未通过检测：%@
source: These components still failed verification after installation: %@
zh_hans: 以下组件安装后仍未通过检测：%@

# 任务或设置编辑正在进行，结束后会自动同步。
source: A task or settings edit is in progress. Sync will resume when it finishes.
zh_hans: 任务或设置编辑正在进行，结束后会自动同步。

# 任务执行期间通过静音音频会话延长后台运行时间，完成后自动释放。系统强制退出或资源限制仍可能中断任务，已保存的进度可以在返回后重试。
source: A silent audio session extends background execution while a task runs and is released when it finishes. System termination or resource limits can still interrupt a task. Return to retry from the saved progress.
zh_hans: 任务执行期间通过静音音频会话延长后台运行时间，完成后自动释放。系统强制退出或资源限制仍可能中断任务，已保存的进度可以在返回后重试。

# 会话
source: Conversation
zh_hans: 会话

# 会话名称
source: Conversation Name
zh_hans: 会话名称

# 会话状态类型不能改变。
source: The session state type cannot change.
zh_hans: 会话状态类型不能改变。

# 会话状态键无效或与持久状态重复。
source: A session state key is invalid or duplicates a persistent state key.
zh_hans: 会话状态键无效或与持久状态重复。

# 你：%@
source: You: %@
zh_hans: 你：%@

# 使用最后一条用户消息重新运行
source: Run again using the last user message
zh_hans: 使用最后一条用户消息重新运行

# 使用模型
source: Models Used
zh_hans: 使用模型

# 保存
source: Save
zh_hans: 保存

# 保存后将使用当前页面的自定义值，后续刷新不会覆盖。
source: Saving uses the custom values on this page. Future refreshes will not overwrite them.
zh_hans: 保存后将使用当前页面的自定义值，后续刷新不会覆盖。

# 保存在系统钥匙串
source: Stored in the system Keychain
zh_hans: 保存在系统钥匙串

# 保存的数据不是普通文件。
source: The saved data is not a regular file.
zh_hans: 保存的数据不是普通文件。

# 保存的数据超过大小限制。
source: The saved data exceeds the size limit.
zh_hans: 保存的数据超过大小限制。

# 修改后使用右侧发送按钮重新运行
source: Use the send button on the right to run again after editing
zh_hans: 修改后使用右侧发送按钮重新运行

# 修改后按 Enter 重新运行，按 Shift-Enter 换行
source: Press Enter to run again after editing, or Shift-Enter for a new line
zh_hans: 修改后按 Enter 重新运行，按 Shift-Enter 换行

# 停止
source: Stop
zh_hans: 停止

# 停止工具调用失败，请稍后重试。
source: Could not stop the tool call. Try again later.
zh_hans: 停止工具调用失败，请稍后重试。

# 停止当前 Agent 运行
source: Stop the current agent run
zh_hans: 停止当前 Agent 运行

# 停止当前工具
source: Stop Current Tool
zh_hans: 停止当前工具

# 停止终端
source: Stop Terminal
zh_hans: 停止终端

# 停止载入
source: Stop Loading
zh_hans: 停止载入

# 健康
source: Health
zh_hans: 健康

# 全部已就绪
source: All Components Ready
zh_hans: 全部已就绪

# 六
source: Sat
zh_hans: 六

# 关闭
source: Close
zh_hans: 关闭

# 关闭后，Agent 将无法访问%@数据。
source: When disabled, the agent cannot access %@ data.
zh_hans: 关闭后，Agent 将无法访问%@数据。

# 关闭当前标签页
source: Close Current Tab
zh_hans: 关闭当前标签页

# 关闭终端
source: Close Terminal
zh_hans: 关闭终端

# 关闭终端（⌘J）
source: Close Terminal (⌘J)
zh_hans: 关闭终端（⌘J）

# 关闭设置
source: Close Settings
zh_hans: 关闭设置

# 内容正在更新
source: Content is updating
zh_hans: 内容正在更新

# 内置
source: Built-in
zh_hans: 内置

# 内置 · %@
source: Built-in · %@
zh_hans: 内置 · %@

# 内置 Alpine rootfs 校验失败，请重新安装应用。
source: The bundled Alpine rootfs failed verification. Reinstall the app.
zh_hans: 内置 Alpine rootfs 校验失败，请重新安装应用。

# 内置 Skill 随应用提供，可以停用，不能删除。
source: Built-in skills ship with the app. They can be disabled, but not deleted.
zh_hans: 内置 Skill 随应用提供，可以停用，不能删除。

# 内置工具安装记录无效。
source: The built-in tool installation record is invalid.
zh_hans: 内置工具安装记录无效。

# 最多安装 200 个工具。
source: You can install up to 200 tools.
zh_hans: 最多安装 200 个工具。

# 最大输出 Token 数
source: Maximum Output Tokens
zh_hans: 最大输出 Token 数

# 最近会话
source: Recent Conversations
zh_hans: 最近会话

# 最长连续 %lld 天
source: Longest streak (days): %lld
zh_hans: 最长连续 %lld 天

# 分析工作区
source: Analyze the Workspace
zh_hans: 分析工作区

# 切换会话
source: Switch Conversation
zh_hans: 切换会话

# 切换到该文件夹
source: Switch to this folder
zh_hans: 切换到该文件夹

# 切换字段必须是布尔值。
source: Toggle fields must be Boolean values.
zh_hans: 切换字段必须是布尔值。

# 列表必须绑定数组，且不能嵌套列表。
source: Lists must bind to arrays and cannot contain nested lists.
zh_hans: 列表必须绑定数组，且不能嵌套列表。

# 列表项：%@
source: List item: %@
zh_hans: 列表项：%@

# 创建一个新的会话
source: Create a new conversation
zh_hans: 创建一个新的会话

# 创建和管理系统闹钟
source: Create and manage system alarms
zh_hans: 创建和管理系统闹钟

# 删除
source: Delete
zh_hans: 删除

# 删除 %@？
source: Delete %@?
zh_hans: 删除 %@？

# 删除会话
source: Delete Conversation
zh_hans: 删除会话

# 删除后，此 Skill 将不再供 Agent 使用。
source: This skill will no longer be available to the agent after deletion.
zh_hans: 删除后，此 Skill 将不再供 Agent 使用。

# 删除工具？
source: Delete Tool?
zh_hans: 删除工具？

# 删除当前服务商
source: Delete Current Provider
zh_hans: 删除当前服务商

# 删除当前模型服务？
source: Delete This Model Provider?
zh_hans: 删除当前模型服务？

# 删除模型
source: Delete Model
zh_hans: 删除模型

# 删除模型服务
source: Delete Model Provider
zh_hans: 删除模型服务

# 刷新
source: Refresh
zh_hans: 刷新

# 刷新用量
source: Refresh Usage
zh_hans: 刷新用量

# 前往设置
source: Open Settings
zh_hans: 前往设置

# 前进
source: Forward
zh_hans: 前进

# 剩余时间
source: Time Remaining
zh_hans: 剩余时间

# 功能特性
source: Capabilities
zh_hans: 功能特性

# 加密备份失败。
source: Could not encrypt the backup.
zh_hans: 加密备份失败。

# 动作 ID 或步骤数量无效。
source: An action ID or step count is invalid.
zh_hans: 动作 ID 或步骤数量无效。

# 动作引用了不存在的状态。
source: The action references state that does not exist.
zh_hans: 动作引用了不存在的状态。

# 动作引用了不存在的页面。
source: The action references a screen that does not exist.
zh_hans: 动作引用了不存在的页面。

# 动作缺少状态键。
source: The action is missing a state key.
zh_hans: 动作缺少状态键。

# 协议
source: Protocol
zh_hans: 协议

# 单个文本字段超过 32 KB。
source: A text field exceeds 32 KB.
zh_hans: 单个文本字段超过 32 KB。

# 占用空间
source: Storage Used
zh_hans: 占用空间

# 历史备份
source: Backup history
zh_hans: 历史备份

# 原生工具
source: Native Tool
zh_hans: 原生工具

# 双击切换思考内容
source: Double-click to switch reasoning content
zh_hans: 双击切换思考内容

# 发送
source: Send
zh_hans: 发送

# 发送消息
source: Send Message
zh_hans: 发送消息

# 发送消息并启动 Agent
source: Send the message and start the agent
zh_hans: 发送消息并启动 Agent

# 发送消息给 OmniBot
source: Send a message to OmniBot
zh_hans: 发送消息给 OmniBot

# 发送第一条消息，或切换时段查看已有记录。
source: Send your first message, or select a different period to view existing records.
zh_hans: 发送第一条消息，或切换时段查看已有记录。

# 取消
source: Cancel
zh_hans: 取消

# 取消收藏
source: Remove from Favorites
zh_hans: 取消收藏

# 取消窗口置顶
source: Unpin Window
zh_hans: 取消窗口置顶

# 取消置顶
source: Unpin
zh_hans: 取消置顶

# 另一个会话正在运行，完成后即可发送。
source: Another conversation is running. You can send when it finishes.
zh_hans: 另一个会话正在运行，完成后即可发送。

# 另一个会话正在运行，请等待其完成后再重试。
source: Another conversation is running. Wait for it to finish before retrying.
zh_hans: 另一个会话正在运行，请等待其完成后再重试。

# 只能编辑或重试最新一条用户消息。
source: Only the most recent user message can be edited or retried.
zh_hans: 只能编辑或重试最新一条用户消息。

# 可用思考强度：no、low、high、xhigh、max
source: Available reasoning effort levels: no, low, high, xhigh, max
zh_hans: 可用思考强度：no、low、high、xhigh、max

# 可继续输入下一条消息，当前回复结束后即可发送
source: You can draft your next message and send it when the current reply finishes
zh_hans: 可继续输入下一条消息，当前回复结束后即可发送

# 可读文本超过 32 KB；大文件请使用支持文件句柄的能力。
source: Readable text exceeds 32 KB. Use a capability that supports file handles for larger files.
zh_hans: 可读文本超过 32 KB；大文件请使用支持文件句柄的能力。

# 右方向键
source: Right Arrow
zh_hans: 右方向键

# 同步已关闭，本机和云端数据均保留。
source: Sync is off. Local and cloud data are retained.
zh_hans: 同步已关闭，本机和云端数据均保留。

# 同步已暂停，稍后会自动重试。
source: Sync paused. It will retry automatically.
zh_hans: 同步已暂停，稍后会自动重试。

# 同步文件超过 64 MB，请缩小文件后重试。本机数据仍然保留。
source: A sync file exceeds 64 MB. Reduce its size and retry. Local data is still retained.
zh_hans: 同步文件超过 64 MB，请缩小文件后重试。本机数据仍然保留。

# 同步未完成，本机数据已保留。
source: Sync did not finish. Local data has been retained.
zh_hans: 同步未完成，本机数据已保留。

# 后台保活暂不可用：%@
source: Background execution is temporarily unavailable: %@
zh_hans: 后台保活暂不可用：%@

# 后台执行
source: Background execution
zh_hans: 后台执行

# 后台继续执行任务
source: Continue tasks in the background
zh_hans: 后台继续执行任务

# 后退
source: Back
zh_hans: 后退

# 否
source: No
zh_hans: 否

# 启用 %@
source: Enable %@
zh_hans: 启用 %@

# 告诉 AI 你需要什么，制作完成后在这里直接使用。
source: Tell AI what you need, then use the finished tool here.
zh_hans: 告诉 AI 你需要什么，制作完成后在这里直接使用。

# 命令
source: Commands
zh_hans: 命令

# 响应次数
source: Responses
zh_hans: 响应次数

# 四
source: Thu
zh_hans: 四

# 回复已中断
source: Reply Interrupted
zh_hans: 回复已中断

# 回复生成失败
source: Reply Failed
zh_hans: 回复生成失败

# 回车
source: Return
zh_hans: 回车

# 图片只保存在本机，并应用到聊天页面背景。
source: Images are stored only on this device and used as the chat background.
zh_hans: 图片只保存在本机，并应用到聊天页面背景。

# 图片应用到聊天页面背景；开启 iCloud 同步后也会同步到其他设备。
source: The image is used as the chat background and syncs to your other devices when iCloud sync is enabled.
zh_hans: 图片应用到聊天页面背景；开启 iCloud 同步后也会同步到其他设备。

# 图片无法读取或超过 20 MB。
source: The image cannot be read or exceeds 20 MB.
zh_hans: 图片无法读取或超过 20 MB。

# 图片输入
source: Image Input
zh_hans: 图片输入

# 在主窗口打开
source: Open in Main Window
zh_hans: 在主窗口打开

# 在主窗口打开当前会话
source: Open this conversation in the main window
zh_hans: 在主窗口打开当前会话

source: Sync chats, attachments, provider settings, preferred model, Soul, Memory, Skills and appearance across iPhone, iPad and Mac using the same Apple Account. API keys, device permissions and the Alpine environment stay on each device; enter API keys again on a new device. Sync resumes after tasks and settings edits finish.
zh_hans: 在使用同一 Apple 账户的 iPhone、iPad 和 Mac 间同步聊天、附件、模型服务配置、默认模型、Soul、Memory、Skills 和外观。API Key、设备权限和 Alpine 环境保留在各设备；新设备需重新填写 API Key。任务或设置编辑完成后再同步。

# 在输入框中重新编辑并发送这条消息
source: Edit and resend this message in the composer
zh_hans: 在输入框中重新编辑并发送这条消息

# 备份与后台执行
source: Backup & Background Tasks
zh_hans: 备份与后台执行

# 备份中的聊天和配置将恢复到当时的版本。当前版本会保留在历史备份中。
source: Chats and settings in this backup will return to that version. The current version will remain in backup history.
zh_hans: 备份中的聊天和配置将恢复到当时的版本。当前版本会保留在历史备份中。

# 备份密码错误，或文件已损坏/格式不受支持。
source: The backup password is incorrect, or the file is damaged or unsupported.
zh_hans: 备份密码错误，或文件已损坏/格式不受支持。

# 备份密码须为 12 至 1024 个字符。
source: The backup password must contain 12 to 1024 characters.
zh_hans: 备份密码须为 12 至 1024 个字符。

# 备份密钥派生失败。
source: Backup key derivation failed.
zh_hans: 备份密钥派生失败。

# 备份已恢复，其他内容已保留。
source: Backup restored. Other content has been retained.
zh_hans: 备份已恢复，其他内容已保留。

# 备份文件或密码过长。
source: The backup file or password is too long.
zh_hans: 备份文件或密码过长。

# 复制
source: Copy
zh_hans: 复制

# 外观
source: Appearance
zh_hans: 外观

# 外观设置无法读取：%@
source: Cannot read appearance settings: %@
zh_hans: 外观设置无法读取：%@

# 多
source: More
zh_hans: 多

# 失败
source: Failed
zh_hans: 失败

# 好
source: OK
zh_hans: 好

# 安装工具后才能调用设备能力。
source: Install the tool before using device capabilities.
zh_hans: 安装工具后才能调用设备能力。

# 安装已执行，但重新检测失败：%@
source: Installation ran, but the follow-up check failed: %@
zh_hans: 安装已执行，但重新检测失败：%@

# 完成
source: Done
zh_hans: 完成

# 完成对话后，模型使用分布会显示在这里。
source: Model usage distribution will appear here after a conversation.
zh_hans: 完成对话后，模型使用分布会显示在这里。

# 密码
source: Password
zh_hans: 密码

# 密码输入必须绑定会话状态。
source: Password inputs must bind to session state.
zh_hans: 密码输入必须绑定会话状态。

# 密钥不是有效的 Base32 编码。
source: The secret is not valid Base32.
zh_hans: 密钥不是有效的 Base32 编码。

# 密钥编码末尾无效。
source: The secret has an invalid encoding suffix.
zh_hans: 密钥编码末尾无效。

# 对应的 API Key 也会从系统钥匙串中删除。
source: The associated API key will also be removed from the system Keychain.
zh_hans: 对应的 API Key 也会从系统钥匙串中删除。

# 对话活跃度
source: Conversation Activity
zh_hans: 对话活跃度

# 导入、启用与管理 Agent 技能
source: Import, enable, and manage agent skills
zh_hans: 导入、启用与管理 Agent 技能

# 导入后超过 200 个账户上限，未保存本次导入。
source: Importing would exceed the 200-account limit. Nothing was imported.
zh_hans: 导入后超过 200 个账户上限，未保存本次导入。

# 导入工具包
source: Import Tool Package
zh_hans: 导入工具包

# 导入附件
source: Import Attachments
zh_hans: 导入附件

# 导出工具包
source: Export Tool Package
zh_hans: 导出工具包

# 将二维码放入取景框
source: Place the QR code inside the frame
zh_hans: 将二维码放入取景框

# 将聊天独立为置顶窗口
source: Open chat in a separate pinned window
zh_hans: 将聊天独立为置顶窗口

# 将载入已保存的数据，当前未保存的修改会被丢弃。
source: Saved data will be loaded, and current unsaved changes will be discarded.
zh_hans: 将载入已保存的数据，当前未保存的修改会被丢弃。

# 少
source: Less
zh_hans: 少

# 展开 Agent 执行过程
source: Expand the agent’s process
zh_hans: 展开 Agent 执行过程

# 展开历史工具调用
source: Expand previous tool calls
zh_hans: 展开历史工具调用

# 工作区
source: Workspace
zh_hans: 工作区

# 工作区中的 Skills 投影不是权威来源，不能重新导入。
source: Workspace skill projections are not authoritative sources and cannot be reimported.
zh_hans: 工作区中的 Skills 投影不是权威来源，不能重新导入。

# 工具
source: Tools
zh_hans: 工具

# 工具不存在或已经删除。
source: The tool does not exist or has been deleted.
zh_hans: 工具不存在或已经删除。

# 工具仍在执行。
source: The tool is still running.
zh_hans: 工具仍在执行。

# 工具包不能超过 256 KB。
source: Tool packages cannot exceed 256 KB.
zh_hans: 工具包不能超过 256 KB。

# 工具包包含未支持的字段；请使用内置 Skill 中的组件与动作协议。
source: The tool package contains unsupported fields. Use the component and action protocol in the built-in skill.
zh_hans: 工具包包含未支持的字段；请使用内置 Skill 中的组件与动作协议。

# 工具包字段不完整或类型错误：%@
source: The tool package has missing fields or incorrect types: %@
zh_hans: 工具包字段不完整或类型错误：%@

# 工具及它保存的数据将被删除。
source: The tool and its saved data will be deleted.
zh_hans: 工具及它保存的数据将被删除。

# 工具及验证码账户将被删除。请先在工具中导出加密备份。
source: The tool and its authentication accounts will be deleted. Export an encrypted backup from the tool first.
zh_hans: 工具及验证码账户将被删除。请先在工具中导出加密备份。

# 工具名称或说明长度不合法。
source: The tool name or description has an invalid length.
zh_hans: 工具名称或说明长度不合法。

# 工具存储目录不可用。
source: The tool storage directory is unavailable.
zh_hans: 工具存储目录不可用。

# 工具完成，Agent 正在继续…
source: The tool finished. The agent is continuing…
zh_hans: 工具完成，Agent 正在继续…

# 工具已更新。请先读取最新工具包，再提交修改。
source: The tool has been updated. Read the latest package before submitting changes.
zh_hans: 工具已更新。请先读取最新工具包，再提交修改。

# 工具或数据已在其他页面更新，请重新载入后继续。
source: The tool or its data was updated elsewhere. Reload before continuing.
zh_hans: 工具或数据已在其他页面更新，请重新载入后继续。

# 工具操作
source: Tool Actions
zh_hans: 工具操作

# 工具操作失败
source: Tool Operation Failed
zh_hans: 工具操作失败

# 工具数据超过 1 MB 上限。
source: Tool data exceeds the 1 MB limit.
zh_hans: 工具数据超过 1 MB 上限。

# 工具没有返回可显示的正文。
source: The tool returned no content to display.
zh_hans: 工具没有返回可显示的正文。

# 工具目录中存在无法识别的记录。
source: The tools directory contains an unrecognized record.
zh_hans: 工具目录中存在无法识别的记录。

# 工具记录无效或过大。
source: The tool record is invalid or too large.
zh_hans: 工具记录无效或过大。
